## 🤖 Terraform Plan Review Bot

**Environment:** dev
**AWS Region:** af-south-1
**Branch:** 1/merge
**Plan Status:** ✅ No changes

### 🔍 Security Scan Results

<details>
<summary><strong>Checkov:</strong> ❌ Failed</summary>

```


       _               _
   ___| |__   ___  ___| | _______   __
  / __| '_ \ / _ \/ __| |/ / _ \ \ / /
 | (__| | | |  __/ (__|   < (_) \ V /
  \___|_| |_|\___|\___|_|\_\___/ \_/

By Prisma Cloud | version: 3.2.494 
Update available 3.2.494 -> 3.2.495
Run pip3 install -U checkov to update 

terraform scan results:

Passed checks: 70, Failed checks: 22, Skipped checks: 0

Check: CKV_AWS_233: "Ensure Create before destroy for ACM certificates"
	PASSED for resource: aws_acm_certificate.main
	File: /acm.tf:2-15
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-acm-certificate-enables-create-before-destroy
Check: CKV_AWS_234: "Verify logging preference for ACM certificates"
	PASSED for resource: aws_acm_certificate.main
	File: /acm.tf:2-15
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-aws-acm-certificates-has-logging-preference
Check: CKV_AWS_163: "Ensure ECR image scanning on push is enabled"
	PASSED for resource: aws_ecr_repository.game_service
	File: /ecr.tf:2-11
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/general-8
Check: CKV_AWS_163: "Ensure ECR image scanning on push is enabled"
	PASSED for resource: aws_ecr_repository.frontend_service
	File: /ecr.tf:13-23
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/general-8
Check: CKV_AWS_223: "Ensure ECS Cluster enables logging of ECS Exec"
	PASSED for resource: module.ecs.aws_ecs_cluster.main
	File: /modules/ecs/main.tf:2-14
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-aws-ecs-cluster-enables-logging-of-ecs-exec
Check: CKV_AWS_328: "Ensure that ALB is configured with defensive or strictest desync mitigation mode"
	PASSED for resource: module.ecs.aws_lb.main
	File: /modules/ecs/main.tf:17-31
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/bc-aws-328
Check: CKV_AWS_131: "Ensure that ALB drops HTTP headers"
	PASSED for resource: module.ecs.aws_lb.main
	File: /modules/ecs/main.tf:17-31
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-that-alb-drops-http-headers
Check: CKV_AWS_261: "Ensure HTTP HTTPS Target group defines Healthcheck"
	PASSED for resource: module.ecs.aws_lb_target_group.services
	File: /modules/ecs/main.tf:33-58
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-aws-kendra-index-server-side-encryption-uses-customer-managed-keys-cmks
Check: CKV_AWS_2: "Ensure ALB protocol is HTTPS"
	PASSED for resource: module.ecs.aws_lb_listener.http
	File: /modules/ecs/main.tf:60-73
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/networking-29
Check: CKV_AWS_2: "Ensure ALB protocol is HTTPS"
	PASSED for resource: module.ecs.aws_lb_listener.https
	File: /modules/ecs/main.tf:75-90
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/networking-29
Check: CKV_AWS_24: "Ensure no security groups allow ingress from 0.0.0.0:0 to port 22"
	PASSED for resource: module.ecs.aws_security_group.alb
	File: /modules/ecs/main.tf:111-142
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/networking-1-port-security
Check: CKV_AWS_25: "Ensure no security groups allow ingress from 0.0.0.0:0 to port 3389"
	PASSED for resource: module.ecs.aws_security_group.alb
	File: /modules/ecs/main.tf:111-142
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/networking-2
Check: CKV_AWS_277: "Ensure no security groups allow ingress from 0.0.0.0:0 to port -1"
	PASSED for resource: module.ecs.aws_security_group.alb
	File: /modules/ecs/main.tf:111-142
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-security-group-does-not-allow-all-traffic-on-all-ports
Check: CKV_AWS_260: "Ensure no security groups allow ingress from 0.0.0.0:0 to port 80"
	PASSED for resource: module.ecs.aws_security_group.ecs_tasks
	File: /modules/ecs/main.tf:144-186
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-security-groups-do-not-allow-ingress-from-00000-to-port-80
Check: CKV_AWS_24: "Ensure no security groups allow ingress from 0.0.0.0:0 to port 22"
	PASSED for resource: module.ecs.aws_security_group.ecs_tasks
	File: /modules/ecs/main.tf:144-186
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/networking-1-port-security
Check: CKV_AWS_25: "Ensure no security groups allow ingress from 0.0.0.0:0 to port 3389"
	PASSED for resource: module.ecs.aws_security_group.ecs_tasks
	File: /modules/ecs/main.tf:144-186
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/networking-2
Check: CKV_AWS_277: "Ensure no security groups allow ingress from 0.0.0.0:0 to port -1"
	PASSED for resource: module.ecs.aws_security_group.ecs_tasks
	File: /modules/ecs/main.tf:144-186
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-security-group-does-not-allow-all-traffic-on-all-ports
Check: CKV_AWS_274: "Disallow IAM roles, users, and groups from using the AWS AdministratorAccess policy"
	PASSED for resource: module.ecs.aws_iam_role.ecs_task_execution_role
	File: /modules/ecs/main.tf:189-209
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-274
Check: CKV_AWS_61: "Ensure AWS IAM policy does not allow assume role permission across all services"
	PASSED for resource: module.ecs.aws_iam_role.ecs_task_execution_role
	File: /modules/ecs/main.tf:189-209
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-iam-45
Check: CKV_AWS_60: "Ensure IAM role allows only specific services or principals to assume it"
	PASSED for resource: module.ecs.aws_iam_role.ecs_task_execution_role
	File: /modules/ecs/main.tf:189-209
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-iam-44
Check: CKV_AWS_274: "Disallow IAM roles, users, and groups from using the AWS AdministratorAccess policy"
	PASSED for resource: module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy
	File: /modules/ecs/main.tf:211-214
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-274
Check: CKV_AWS_274: "Disallow IAM roles, users, and groups from using the AWS AdministratorAccess policy"
	PASSED for resource: module.ecs.aws_iam_role.ecs_task_role
	File: /modules/ecs/main.tf:216-236
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-274
Check: CKV_AWS_61: "Ensure AWS IAM policy does not allow assume role permission across all services"
	PASSED for resource: module.ecs.aws_iam_role.ecs_task_role
	File: /modules/ecs/main.tf:216-236
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-iam-45
Check: CKV_AWS_60: "Ensure IAM role allows only specific services or principals to assume it"
	PASSED for resource: module.ecs.aws_iam_role.ecs_task_role
	File: /modules/ecs/main.tf:216-236
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-iam-44
Check: CKV_AWS_158: "Ensure that CloudWatch Log Group is encrypted by KMS"
	PASSED for resource: module.ecs.aws_cloudwatch_log_group.services["frontend-service"]
	File: /modules/ecs/main.tf:239-250
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-that-cloudwatch-log-group-is-encrypted-by-kms
Check: CKV_AWS_66: "Ensure that CloudWatch Log Group specifies retention days"
	PASSED for resource: module.ecs.aws_cloudwatch_log_group.services["frontend-service"]
	File: /modules/ecs/main.tf:239-250
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/logging-13
Check: CKV_AWS_336: "Ensure ECS containers are limited to read-only access to root filesystems"
	PASSED for resource: module.ecs.aws_ecs_task_definition.services["frontend-service"]
	File: /modules/ecs/main.tf:253-309
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-336
Check: CKV_AWS_97: "Ensure Encryption in transit is enabled for EFS volumes in ECS Task definitions"
	PASSED for resource: module.ecs.aws_ecs_task_definition.services["frontend-service"]
	File: /modules/ecs/main.tf:253-309
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-general-39
Check: CKV_AWS_249: "Ensure that the Execution Role ARN and the Task Role ARN are different in ECS Task definitions"
	PASSED for resource: module.ecs.aws_ecs_task_definition.services["frontend-service"]
	File: /modules/ecs/main.tf:253-309
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/ensure-the-aws-execution-role-arn-and-task-role-arn-are-different-in-ecs-task-definitions
Check: CKV_AWS_333: "Ensure ECS services do not have public IP addresses assigned to them automatically"
	PASSED for resource: module.ecs.aws_ecs_service.services["frontend-service"]
	File: /modules/ecs/main.tf:346-382
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/bc-aws-333
Check: CKV_AWS_332: "Ensure ECS Fargate services run on the latest Fargate platform version"
	PASSED for resource: module.ecs.aws_ecs_service.services["frontend-service"]
	File: /modules/ecs/main.tf:346-382
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-332
Check: CKV_AWS_158: "Ensure that CloudWatch Log Group is encrypted by KMS"
	PASSED for resource: module.ecs.aws_cloudwatch_log_group.services["game-service"]
	File: /modules/ecs/main.tf:239-250
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-that-cloudwatch-log-group-is-encrypted-by-kms
Check: CKV_AWS_66: "Ensure that CloudWatch Log Group specifies retention days"
	PASSED for resource: module.ecs.aws_cloudwatch_log_group.services["game-service"]
	File: /modules/ecs/main.tf:239-250
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/logging-13
Check: CKV_AWS_336: "Ensure ECS containers are limited to read-only access to root filesystems"
	PASSED for resource: module.ecs.aws_ecs_task_definition.services["game-service"]
	File: /modules/ecs/main.tf:253-309
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-336
Check: CKV_AWS_97: "Ensure Encryption in transit is enabled for EFS volumes in ECS Task definitions"
	PASSED for resource: module.ecs.aws_ecs_task_definition.services["game-service"]
	File: /modules/ecs/main.tf:253-309
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-general-39
Check: CKV_AWS_249: "Ensure that the Execution Role ARN and the Task Role ARN are different in ECS Task definitions"
	PASSED for resource: module.ecs.aws_ecs_task_definition.services["game-service"]
	File: /modules/ecs/main.tf:253-309
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/ensure-the-aws-execution-role-arn-and-task-role-arn-are-different-in-ecs-task-definitions
Check: CKV_AWS_333: "Ensure ECS services do not have public IP addresses assigned to them automatically"
	PASSED for resource: module.ecs.aws_ecs_service.services["game-service"]
	File: /modules/ecs/main.tf:346-382
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/bc-aws-333
Check: CKV_AWS_332: "Ensure ECS Fargate services run on the latest Fargate platform version"
	PASSED for resource: module.ecs.aws_ecs_service.services["game-service"]
	File: /modules/ecs/main.tf:346-382
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-332
Check: CKV_AWS_158: "Ensure that CloudWatch Log Group is encrypted by KMS"
	PASSED for resource: module.ecs.aws_cloudwatch_log_group.grafana[0]
	File: /modules/ecs/monitoring.tf:7-18
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-that-cloudwatch-log-group-is-encrypted-by-kms
Check: CKV_AWS_66: "Ensure that CloudWatch Log Group specifies retention days"
	PASSED for resource: module.ecs.aws_cloudwatch_log_group.grafana[0]
	File: /modules/ecs/monitoring.tf:7-18
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/logging-13
Check: CKV_AWS_158: "Ensure that CloudWatch Log Group is encrypted by KMS"
	PASSED for resource: module.ecs.aws_cloudwatch_log_group.prometheus[0]
	File: /modules/ecs/monitoring.tf:21-32
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-that-cloudwatch-log-group-is-encrypted-by-kms
Check: CKV_AWS_66: "Ensure that CloudWatch Log Group specifies retention days"
	PASSED for resource: module.ecs.aws_cloudwatch_log_group.prometheus[0]
	File: /modules/ecs/monitoring.tf:21-32
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/logging-13
Check: CKV_AWS_336: "Ensure ECS containers are limited to read-only access to root filesystems"
	PASSED for resource: module.ecs.aws_ecs_task_definition.monitoring[0]
	File: /modules/ecs/monitoring.tf:35-124
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-336
Check: CKV_AWS_97: "Ensure Encryption in transit is enabled for EFS volumes in ECS Task definitions"
	PASSED for resource: module.ecs.aws_ecs_task_definition.monitoring[0]
	File: /modules/ecs/monitoring.tf:35-124
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-general-39
Check: CKV_AWS_249: "Ensure that the Execution Role ARN and the Task Role ARN are different in ECS Task definitions"
	PASSED for resource: module.ecs.aws_ecs_task_definition.monitoring[0]
	File: /modules/ecs/monitoring.tf:35-124
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/ensure-the-aws-execution-role-arn-and-task-role-arn-are-different-in-ecs-task-definitions
Check: CKV_AWS_261: "Ensure HTTP HTTPS Target group defines Healthcheck"
	PASSED for resource: module.ecs.aws_lb_target_group.grafana[0]
	File: /modules/ecs/monitoring.tf:127-152
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-aws-kendra-index-server-side-encryption-uses-customer-managed-keys-cmks
Check: CKV_AWS_333: "Ensure ECS services do not have public IP addresses assigned to them automatically"
	PASSED for resource: module.ecs.aws_ecs_service.monitoring[0]
	File: /modules/ecs/monitoring.tf:174-200
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/bc-aws-333
Check: CKV_AWS_332: "Ensure ECS Fargate services run on the latest Fargate platform version"
	PASSED for resource: module.ecs.aws_ecs_service.monitoring[0]
	File: /modules/ecs/monitoring.tf:174-200
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-332
Check: CKV_AWS_130: "Ensure VPC subnets do not assign public IP by default"
	PASSED for resource: module.network.aws_subnet.private[0]
	File: /modules/network/main.tf:44-56
	Calling File: /main.tf:2-7
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-vpc-subnets-do-not-assign-public-ip-by-default
Check: CKV_AWS_130: "Ensure VPC subnets do not assign public IP by default"
	PASSED for resource: module.network.aws_subnet.private[1]
	File: /modules/network/main.tf:44-56
	Calling File: /main.tf:2-7
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-vpc-subnets-do-not-assign-public-ip-by-default
Check: CKV_AWS_41: "Ensure no hard coded AWS access key and secret key exists in provider"
	PASSED for resource: aws.default
	File: /provider.tf:18-20
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/secrets-policies/bc-aws-secrets-5
Check: CKV2_AWS_56: "Ensure AWS Managed IAMFullAccess IAM policy is not used."
	PASSED for resource: module.ecs.aws_iam_role.ecs_task_execution_role
	File: /modules/ecs/main.tf:189-209
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-2-56
Check: CKV2_AWS_56: "Ensure AWS Managed IAMFullAccess IAM policy is not used."
	PASSED for resource: module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy
	File: /modules/ecs/main.tf:211-214
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-2-56
Check: CKV2_AWS_56: "Ensure AWS Managed IAMFullAccess IAM policy is not used."
	PASSED for resource: module.ecs.aws_iam_role.ecs_task_role
	File: /modules/ecs/main.tf:216-236
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-2-56
Check: CKV2_AWS_44: "Ensure AWS route table with VPC peering does not contain routes overly permissive to all traffic"
	PASSED for resource: module.network.aws_route_table.public
	File: /modules/network/main.tf:86-98
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-route-table-with-vpc-peering-does-not-contain-routes-overly-permissive-to-all-traffic
Check: CKV2_AWS_44: "Ensure AWS route table with VPC peering does not contain routes overly permissive to all traffic"
	PASSED for resource: module.network.aws_route_table.private[0]
	File: /modules/network/main.tf:100-125
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-route-table-with-vpc-peering-does-not-contain-routes-overly-permissive-to-all-traffic
Check: CKV2_AWS_44: "Ensure AWS route table with VPC peering does not contain routes overly permissive to all traffic"
	PASSED for resource: module.network.aws_route_table.private[1]
	File: /modules/network/main.tf:100-125
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-route-table-with-vpc-peering-does-not-contain-routes-overly-permissive-to-all-traffic
Check: CKV2_AWS_76: "Ensure AWS ALB attached WAFv2 WebACL is configured with AMR for Log4j Vulnerability"
	PASSED for resource: module.ecs.aws_lb.main
	File: /modules/ecs/main.tf:17-31
Check: CKV2_AWS_19: "Ensure that all EIP addresses allocated to a VPC are attached to EC2 instances"
	PASSED for resource: module.network.aws_eip.nat[0]
	File: /modules/network/main.tf:59-69
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-that-all-eip-addresses-allocated-to-a-vpc-are-attached-to-ec2-instances
Check: CKV2_AWS_19: "Ensure that all EIP addresses allocated to a VPC are attached to EC2 instances"
	PASSED for resource: module.network.aws_eip.nat[1]
	File: /modules/network/main.tf:59-69
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-that-all-eip-addresses-allocated-to-a-vpc-are-attached-to-ec2-instances
Check: CKV2_AWS_5: "Ensure that Security Groups are attached to another resource"
	PASSED for resource: module.ecs.aws_security_group.alb
	File: /modules/ecs/main.tf:111-142
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-that-security-groups-are-attached-to-ec2-instances-or-elastic-network-interfaces-enis
Check: CKV2_AWS_5: "Ensure that Security Groups are attached to another resource"
	PASSED for resource: module.ecs.aws_security_group.ecs_tasks
	File: /modules/ecs/main.tf:144-186
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-that-security-groups-are-attached-to-ec2-instances-or-elastic-network-interfaces-enis
Check: CKV2_AWS_35: "AWS NAT Gateways should be utilized for the default route"
	PASSED for resource: module.network.aws_route_table.public
	File: /modules/network/main.tf:86-98
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-nat-gateways-are-utilized-for-the-default-route
Check: CKV2_AWS_35: "AWS NAT Gateways should be utilized for the default route"
	PASSED for resource: module.network.aws_route_table.private[0]
	File: /modules/network/main.tf:100-125
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-nat-gateways-are-utilized-for-the-default-route
Check: CKV2_AWS_35: "AWS NAT Gateways should be utilized for the default route"
	PASSED for resource: module.network.aws_route_table.private[1]
	File: /modules/network/main.tf:100-125
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-nat-gateways-are-utilized-for-the-default-route
Check: CKV2_AWS_74: "Ensure AWS Load Balancers use strong ciphers"
	PASSED for resource: module.ecs.aws_lb_listener.http
	File: /modules/ecs/main.tf:60-73
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/bc-aws-2-74
Check: CKV2_AWS_74: "Ensure AWS Load Balancers use strong ciphers"
	PASSED for resource: module.ecs.aws_lb_listener.https
	File: /modules/ecs/main.tf:75-90
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/bc-aws-2-74
Check: CKV2_AWS_20: "Ensure that ALB redirects HTTP requests into HTTPS ones"
	PASSED for resource: module.ecs.aws_lb.main
	File: /modules/ecs/main.tf:17-31
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-that-alb-redirects-http-requests-into-https-ones
Check: CKV_AWS_103: "Ensure that load balancer is using at least TLS 1.2"
	PASSED for resource: module.ecs.aws_lb_listener.https
	File: /modules/ecs/main.tf:75-90
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-general-43
Check: CKV_AWS_103: "Ensure that load balancer is using at least TLS 1.2"
	PASSED for resource: module.ecs.aws_lb_listener.http
	File: /modules/ecs/main.tf:60-73
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-general-43
Check: CKV_AWS_136: "Ensure that ECR repositories are encrypted using KMS"
	FAILED for resource: aws_ecr_repository.game_service
	File: /ecr.tf:2-11
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-that-ecr-repositories-are-encrypted

		2  | resource "aws_ecr_repository" "game_service" {
		3  |   name                 = "${var.project_name}-game-service"
		4  |   image_tag_mutability = "MUTABLE"
		5  | 
		6  |   image_scanning_configuration {
		7  |     scan_on_push = true
		8  |   }
		9  | 
		10 |   tags = var.tags
		11 | }

Check: CKV_AWS_51: "Ensure ECR Image Tags are immutable"
	FAILED for resource: aws_ecr_repository.game_service
	File: /ecr.tf:2-11
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-general-24

		2  | resource "aws_ecr_repository" "game_service" {
		3  |   name                 = "${var.project_name}-game-service"
		4  |   image_tag_mutability = "MUTABLE"
		5  | 
		6  |   image_scanning_configuration {
		7  |     scan_on_push = true
		8  |   }
		9  | 
		10 |   tags = var.tags
		11 | }

Check: CKV_AWS_136: "Ensure that ECR repositories are encrypted using KMS"
	FAILED for resource: aws_ecr_repository.frontend_service
	File: /ecr.tf:13-23
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-that-ecr-repositories-are-encrypted

		13 | resource "aws_ecr_repository" "frontend_service" {
		14 |   name                 = "${var.project_name}-frontend-service"
		15 |   image_tag_mutability = "MUTABLE"
		16 | 
		17 |   image_scanning_configuration {
		18 |     scan_on_push = true
		19 |   }
		20 | 
		21 |   tags = var.tags
		22 |   
		23 | }

Check: CKV_AWS_51: "Ensure ECR Image Tags are immutable"
	FAILED for resource: aws_ecr_repository.frontend_service
	File: /ecr.tf:13-23
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-general-24

		13 | resource "aws_ecr_repository" "frontend_service" {
		14 |   name                 = "${var.project_name}-frontend-service"
		15 |   image_tag_mutability = "MUTABLE"
		16 | 
		17 |   image_scanning_configuration {
		18 |     scan_on_push = true
		19 |   }
		20 | 
		21 |   tags = var.tags
		22 |   
		23 | }

Check: CKV_AWS_65: "Ensure container insights are enabled on ECS cluster"
	FAILED for resource: module.ecs.aws_ecs_cluster.main
	File: /modules/ecs/main.tf:2-14
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/bc-aws-logging-11

		2  | resource "aws_ecs_cluster" "main" {
		3  |   name = "${var.environment}-${var.project_name}-cluster"
		4  | 
		5  |   setting {
		6  |     name  = "containerInsights"
		7  |     value = var.container_insights_enabled ? "enabled" : "disabled"
		8  |   }
		9  | 
		10 |   tags = merge(var.tags, {
		11 |     Name        = "${var.environment}-${var.project_name}-cluster"
		12 |     Environment = var.environment
		13 |   })
		14 | }

Check: CKV_AWS_91: "Ensure the ELBv2 (Application/Network) has access logging enabled"
	FAILED for resource: module.ecs.aws_lb.main
	File: /modules/ecs/main.tf:17-31
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/bc-aws-logging-22

		17 | resource "aws_lb" "main" {
		18 |   name               = "${var.environment}-${var.project_name}-alb"
		19 |   internal           = var.alb_internal
		20 |   load_balancer_type = "application"
		21 |   security_groups    = [aws_security_group.alb.id]
		22 |   subnets            = var.public_subnet_ids
		23 | 
		24 |   enable_deletion_protection = var.environment == "prod"
		25 |   drop_invalid_header_fields = true
		26 | 
		27 |   tags = merge(var.tags, {
		28 |     Name        = "${var.environment}-${var.project_name}-alb"
		29 |     Environment = var.environment
		30 |   })
		31 | }

Check: CKV_AWS_260: "Ensure no security groups allow ingress from 0.0.0.0:0 to port 80"
	FAILED for resource: module.ecs.aws_security_group.alb
	File: /modules/ecs/main.tf:111-142
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-security-groups-do-not-allow-ingress-from-00000-to-port-80

		111 | resource "aws_security_group" "alb" {
		112 |   name_prefix = "${var.environment}-${var.project_name}-alb-"
		113 |   vpc_id      = var.vpc_id
		114 | 
		115 |   ingress {
		116 |     description = "HTTP"
		117 |     from_port   = 80
		118 |     to_port     = 80
		119 |     protocol    = "tcp"
		120 |     cidr_blocks = ["0.0.0.0/0"]
		121 |   }
		122 | 
		123 |   ingress {
		124 |     description = "HTTPS"
		125 |     from_port   = 443
		126 |     to_port     = 443
		127 |     protocol    = "tcp"
		128 |     cidr_blocks = ["0.0.0.0/0"]
		129 |   }
		130 | 
		131 |   egress {
		132 |     from_port   = 0
		133 |     to_port     = 0
		134 |     protocol    = "-1"
		135 |     cidr_blocks = ["0.0.0.0/0"]
		136 |   }
		137 | 
		138 |   tags = merge(var.tags, {
		139 |     Name        = "${var.environment}-${var.project_name}-alb-sg"
		140 |     Environment = var.environment
		141 |   })
		142 | }

Check: CKV_AWS_23: "Ensure every security group and rule has a description"
	FAILED for resource: module.ecs.aws_security_group.alb
	File: /modules/ecs/main.tf:111-142
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/networking-31

		111 | resource "aws_security_group" "alb" {
		112 |   name_prefix = "${var.environment}-${var.project_name}-alb-"
		113 |   vpc_id      = var.vpc_id
		114 | 
		115 |   ingress {
		116 |     description = "HTTP"
		117 |     from_port   = 80
		118 |     to_port     = 80
		119 |     protocol    = "tcp"
		120 |     cidr_blocks = ["0.0.0.0/0"]
		121 |   }
		122 | 
		123 |   ingress {
		124 |     description = "HTTPS"
		125 |     from_port   = 443
		126 |     to_port     = 443
		127 |     protocol    = "tcp"
		128 |     cidr_blocks = ["0.0.0.0/0"]
		129 |   }
		130 | 
		131 |   egress {
		132 |     from_port   = 0
		133 |     to_port     = 0
		134 |     protocol    = "-1"
		135 |     cidr_blocks = ["0.0.0.0/0"]
		136 |   }
		137 | 
		138 |   tags = merge(var.tags, {
		139 |     Name        = "${var.environment}-${var.project_name}-alb-sg"
		140 |     Environment = var.environment
		141 |   })
		142 | }

Check: CKV_AWS_382: "Ensure no security groups allow egress from 0.0.0.0:0 to port -1"
	FAILED for resource: module.ecs.aws_security_group.alb
	File: /modules/ecs/main.tf:111-142
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/bc-aws-382

		111 | resource "aws_security_group" "alb" {
		112 |   name_prefix = "${var.environment}-${var.project_name}-alb-"
		113 |   vpc_id      = var.vpc_id
		114 | 
		115 |   ingress {
		116 |     description = "HTTP"
		117 |     from_port   = 80
		118 |     to_port     = 80
		119 |     protocol    = "tcp"
		120 |     cidr_blocks = ["0.0.0.0/0"]
		121 |   }
		122 | 
		123 |   ingress {
		124 |     description = "HTTPS"
		125 |     from_port   = 443
		126 |     to_port     = 443
		127 |     protocol    = "tcp"
		128 |     cidr_blocks = ["0.0.0.0/0"]
		129 |   }
		130 | 
		131 |   egress {
		132 |     from_port   = 0
		133 |     to_port     = 0
		134 |     protocol    = "-1"
		135 |     cidr_blocks = ["0.0.0.0/0"]
		136 |   }
		137 | 
		138 |   tags = merge(var.tags, {
		139 |     Name        = "${var.environment}-${var.project_name}-alb-sg"
		140 |     Environment = var.environment
		141 |   })
		142 | }

Check: CKV_AWS_23: "Ensure every security group and rule has a description"
	FAILED for resource: module.ecs.aws_security_group.ecs_tasks
	File: /modules/ecs/main.tf:144-186
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/networking-31

		144 | resource "aws_security_group" "ecs_tasks" {
		145 |   name_prefix = "${var.environment}-${var.project_name}-ecs-tasks-"
		146 |   vpc_id      = var.vpc_id
		147 | 
		148 |   dynamic "ingress" {
		149 |     for_each = { for k, v in var.services : k => v if v.expose_alb }
		150 |     content {
		151 |       description     = "HTTP from ALB for ${ingress.key}"
		152 |       from_port       = ingress.value.port
		153 |       to_port         = ingress.value.port
		154 |       protocol        = "tcp"
		155 |       security_groups = [aws_security_group.alb.id]
		156 |     }
		157 |   }
		158 | 
		159 |   ingress {
		160 |     description     = "Grafana from ALB"
		161 |     from_port       = 3000
		162 |     to_port         = 3000
		163 |     protocol        = "tcp"
		164 |     security_groups = [aws_security_group.alb.id]
		165 |   }
		166 | 
		167 |   ingress {
		168 |     description = "Service to service"
		169 |     from_port   = 0
		170 |     to_port     = 65535
		171 |     protocol    = "tcp"
		172 |     self        = true
		173 |   }
		174 | 
		175 |   egress {
		176 |     from_port   = 0
		177 |     to_port     = 0
		178 |     protocol    = "-1"
		179 |     cidr_blocks = ["0.0.0.0/0"]
		180 |   }
		181 | 
		182 |   tags = merge(var.tags, {
		183 |     Name        = "${var.environment}-${var.project_name}-ecs-tasks-sg"
		184 |     Environment = var.environment
		185 |   })
		186 | }

Check: CKV_AWS_382: "Ensure no security groups allow egress from 0.0.0.0:0 to port -1"
	FAILED for resource: module.ecs.aws_security_group.ecs_tasks
	File: /modules/ecs/main.tf:144-186
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/bc-aws-382

		144 | resource "aws_security_group" "ecs_tasks" {
		145 |   name_prefix = "${var.environment}-${var.project_name}-ecs-tasks-"
		146 |   vpc_id      = var.vpc_id
		147 | 
		148 |   dynamic "ingress" {
		149 |     for_each = { for k, v in var.services : k => v if v.expose_alb }
		150 |     content {
		151 |       description     = "HTTP from ALB for ${ingress.key}"
		152 |       from_port       = ingress.value.port
		153 |       to_port         = ingress.value.port
		154 |       protocol        = "tcp"
		155 |       security_groups = [aws_security_group.alb.id]
		156 |     }
		157 |   }
		158 | 
		159 |   ingress {
		160 |     description     = "Grafana from ALB"
		161 |     from_port       = 3000
		162 |     to_port         = 3000
		163 |     protocol        = "tcp"
		164 |     security_groups = [aws_security_group.alb.id]
		165 |   }
		166 | 
		167 |   ingress {
		168 |     description = "Service to service"
		169 |     from_port   = 0
		170 |     to_port     = 65535
		171 |     protocol    = "tcp"
		172 |     self        = true
		173 |   }
		174 | 
		175 |   egress {
		176 |     from_port   = 0
		177 |     to_port     = 0
		178 |     protocol    = "-1"
		179 |     cidr_blocks = ["0.0.0.0/0"]
		180 |   }
		181 | 
		182 |   tags = merge(var.tags, {
		183 |     Name        = "${var.environment}-${var.project_name}-ecs-tasks-sg"
		184 |     Environment = var.environment
		185 |   })
		186 | }

Check: CKV_AWS_338: "Ensure CloudWatch log groups retains logs for at least 1 year"
	FAILED for resource: module.ecs.aws_cloudwatch_log_group.services["frontend-service"]
	File: /modules/ecs/main.tf:239-250
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/bc-aws-338

		239 | resource "aws_cloudwatch_log_group" "services" {
		240 |   for_each = var.services
		241 | 
		242 |   name              = "/ecs/${var.environment}-${var.project_name}-${each.key}"
		243 |   retention_in_days = var.log_retention_days
		244 |   kms_key_id        = var.kms_key_id
		245 | 
		246 |   tags = merge(var.tags, {
		247 |     Name        = "${var.environment}-${var.project_name}-${each.key}-logs"
		248 |     Environment = var.environment
		249 |   })
		250 | }

Check: CKV_AWS_338: "Ensure CloudWatch log groups retains logs for at least 1 year"
	FAILED for resource: module.ecs.aws_cloudwatch_log_group.services["game-service"]
	File: /modules/ecs/main.tf:239-250
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/bc-aws-338

		239 | resource "aws_cloudwatch_log_group" "services" {
		240 |   for_each = var.services
		241 | 
		242 |   name              = "/ecs/${var.environment}-${var.project_name}-${each.key}"
		243 |   retention_in_days = var.log_retention_days
		244 |   kms_key_id        = var.kms_key_id
		245 | 
		246 |   tags = merge(var.tags, {
		247 |     Name        = "${var.environment}-${var.project_name}-${each.key}-logs"
		248 |     Environment = var.environment
		249 |   })
		250 | }

Check: CKV_AWS_338: "Ensure CloudWatch log groups retains logs for at least 1 year"
	FAILED for resource: module.ecs.aws_cloudwatch_log_group.grafana[0]
	File: /modules/ecs/monitoring.tf:7-18
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/bc-aws-338

		7  | resource "aws_cloudwatch_log_group" "grafana" {
		8  |   count = local.monitoring_enabled ? 1 : 0
		9  | 
		10 |   name              = "/ecs/${var.environment}-${var.project_name}-grafana"
		11 |   retention_in_days = var.log_retention_days
		12 |   kms_key_id        = var.kms_key_id
		13 | 
		14 |   tags = merge(var.tags, {
		15 |     Name        = "${var.environment}-${var.project_name}-grafana-logs"
		16 |     Environment = var.environment
		17 |   })
		18 | }

Check: CKV_AWS_338: "Ensure CloudWatch log groups retains logs for at least 1 year"
	FAILED for resource: module.ecs.aws_cloudwatch_log_group.prometheus[0]
	File: /modules/ecs/monitoring.tf:21-32
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/bc-aws-338

		21 | resource "aws_cloudwatch_log_group" "prometheus" {
		22 |   count = local.monitoring_enabled ? 1 : 0
		23 | 
		24 |   name              = "/ecs/${var.environment}-${var.project_name}-prometheus"
		25 |   retention_in_days = var.log_retention_days
		26 |   kms_key_id        = var.kms_key_id
		27 | 
		28 |   tags = merge(var.tags, {
		29 |     Name        = "${var.environment}-${var.project_name}-prometheus-logs"
		30 |     Environment = var.environment
		31 |   })
		32 | }

Check: CKV_AWS_130: "Ensure VPC subnets do not assign public IP by default"
	FAILED for resource: module.network.aws_subnet.public[0]
	File: /modules/network/main.tf:28-41
	Calling File: /main.tf:2-7
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-vpc-subnets-do-not-assign-public-ip-by-default

		28 | resource "aws_subnet" "public" {
		29 |   count = 2
		30 | 
		31 |   vpc_id                  = aws_vpc.main.id
		32 |   cidr_block              = cidrsubnet(var.vpc_cidr, 8, count.index)
		33 |   availability_zone       = data.aws_availability_zones.available.names[count.index]
		34 |   map_public_ip_on_launch = true
		35 | 
		36 |   tags = {
		37 |     Name        = "${var.environment}-${var.project_name}-public-${count.index + 1}"
		38 |     Environment = var.environment
		39 |     Type        = "Public"
		40 |   }
		41 | }

Check: CKV_AWS_130: "Ensure VPC subnets do not assign public IP by default"
	FAILED for resource: module.network.aws_subnet.public[1]
	File: /modules/network/main.tf:28-41
	Calling File: /main.tf:2-7
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-vpc-subnets-do-not-assign-public-ip-by-default

		28 | resource "aws_subnet" "public" {
		29 |   count = 2
		30 | 
		31 |   vpc_id                  = aws_vpc.main.id
		32 |   cidr_block              = cidrsubnet(var.vpc_cidr, 8, count.index)
		33 |   availability_zone       = data.aws_availability_zones.available.names[count.index]
		34 |   map_public_ip_on_launch = true
		35 | 
		36 |   tags = {
		37 |     Name        = "${var.environment}-${var.project_name}-public-${count.index + 1}"
		38 |     Environment = var.environment
		39 |     Type        = "Public"
		40 |   }
		41 | }

Check: CKV2_AWS_28: "Ensure public facing ALB are protected by WAF"
	FAILED for resource: module.ecs.aws_lb.main
	File: /modules/ecs/main.tf:17-31
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-public-facing-alb-are-protected-by-waf

		17 | resource "aws_lb" "main" {
		18 |   name               = "${var.environment}-${var.project_name}-alb"
		19 |   internal           = var.alb_internal
		20 |   load_balancer_type = "application"
		21 |   security_groups    = [aws_security_group.alb.id]
		22 |   subnets            = var.public_subnet_ids
		23 | 
		24 |   enable_deletion_protection = var.environment == "prod"
		25 |   drop_invalid_header_fields = true
		26 | 
		27 |   tags = merge(var.tags, {
		28 |     Name        = "${var.environment}-${var.project_name}-alb"
		29 |     Environment = var.environment
		30 |   })
		31 | }

Check: CKV_AWS_378: "Ensure AWS Load Balancer doesn't use HTTP protocol"
	FAILED for resource: module.ecs.aws_lb_target_group.services
	File: /modules/ecs/main.tf:33-58
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/bc-aws-378

		33 | resource "aws_lb_target_group" "services" {
		34 |   for_each = { for k, v in var.services : k => v if v.expose_alb }
		35 | 
		36 |   name     = "${var.environment}-${substr(each.key, 0, 20)}-tg"
		37 |   port     = each.value.port
		38 |   protocol = "HTTP"
		39 |   vpc_id   = var.vpc_id
		40 |   target_type = "ip"
		41 | 
		42 |   health_check {
		43 |     enabled             = true
		44 |     healthy_threshold   = var.health_check_healthy_threshold
		45 |     interval            = var.health_check_interval
		46 |     matcher             = "200"
		47 |     path                = var.health_check_path
		48 |     port                = "traffic-port"
		49 |     protocol            = "HTTP"
		50 |     timeout             = var.health_check_timeout
		51 |     unhealthy_threshold = var.health_check_unhealthy_threshold
		52 |   }
		53 | 
		54 |   tags = merge(var.tags, {
		55 |     Name        = "${var.environment}-${var.project_name}-${each.key}-tg"
		56 |     Environment = var.environment
		57 |   })
		58 | }

Check: CKV_AWS_378: "Ensure AWS Load Balancer doesn't use HTTP protocol"
	FAILED for resource: module.ecs.aws_lb_target_group.grafana[0]
	File: /modules/ecs/monitoring.tf:127-152
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/bc-aws-378

		127 | resource "aws_lb_target_group" "grafana" {
		128 |   count = local.monitoring_enabled ? 1 : 0
		129 | 
		130 |   name     = "${var.environment}-grafana-tg"
		131 |   port     = 3000
		132 |   protocol = "HTTP"
		133 |   vpc_id   = var.vpc_id
		134 |   target_type = "ip"
		135 | 
		136 |   health_check {
		137 |     enabled             = true
		138 |     healthy_threshold   = var.health_check_healthy_threshold
		139 |     interval            = var.health_check_interval
		140 |     matcher             = "200"
		141 |     path                = "/api/health"
		142 |     port                = "traffic-port"
		143 |     protocol            = "HTTP"
		144 |     timeout             = var.health_check_timeout
		145 |     unhealthy_threshold = var.health_check_unhealthy_threshold
		146 |   }
		147 | 
		148 |   tags = merge(var.tags, {
		149 |     Name        = "${var.environment}-${var.project_name}-grafana-tg"
		150 |     Environment = var.environment
		151 |   })
		152 | }

Check: CKV2_AWS_12: "Ensure the default security group of every VPC restricts all traffic"
	FAILED for resource: module.network.aws_vpc.main
	File: /modules/network/main.tf:6-15
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/networking-4

		6  | resource "aws_vpc" "main" {
		7  |   cidr_block           = var.vpc_cidr
		8  |   enable_dns_hostnames = true
		9  |   enable_dns_support   = true
		10 | 
		11 |   tags = merge(var.tags, {
		12 |     Name        = "${var.environment}-${var.project_name}-vpc"
		13 |     Environment = var.environment
		14 |   })
		15 | }

Check: CKV2_AWS_11: "Ensure VPC flow logging is enabled in all VPCs"
	FAILED for resource: module.network.aws_vpc.main
	File: /modules/network/main.tf:6-15
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/logging-9-enable-vpc-flow-logging

		6  | resource "aws_vpc" "main" {
		7  |   cidr_block           = var.vpc_cidr
		8  |   enable_dns_hostnames = true
		9  |   enable_dns_support   = true
		10 | 
		11 |   tags = merge(var.tags, {
		12 |     Name        = "${var.environment}-${var.project_name}-vpc"
		13 |     Environment = var.environment
		14 |   })
		15 | }



Wrote output in SARIF format to the file 'results.sarif'
```
</details>

<details>
<summary><strong>TFLint:</strong> ❌ Failed</summary>

```
TFLint scan completed - check workflow logs for detailed results
```
</details>

<details>
<summary><strong>TFSec:</strong> ❌ Failed</summary>

```
TFSec scan completed - check workflow logs for detailed results
```
</details>

### 📋 Terraform Plan Output
<details>
<summary>Click to view plan details</summary>

```terraform
[command]/home/runner/work/_temp/eafcb283-b8bf-4bb6-afde-e51b4792dbff/terraform-bin plan -var-file=./terraform.tfvars -no-color -detailed-exitcode
data.cloudflare_zone.this: Reading...
data.aws_caller_identity.current: Reading...
module.network.data.aws_availability_zones.available: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=718307299417]
module.network.data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
data.cloudflare_zone.this: Read complete after 2s [id=706bde896e93c6118ccea3f36ee729a1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_acm_certificate.main will be created
  + resource "aws_acm_certificate" "main" {
      + arn                       = (known after apply)
      + domain_name               = "cloudgt.co.za"
      + domain_validation_options = [
          + {
              + domain_name           = "*.cloudgt.co.za"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "cloudgt.co.za"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.cloudgt.co.za",
          + "cloudgt.co.za",
        ]
      + tags                      = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-cert"
        }
      + tags_all                  = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-cert"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_acm_certificate_validation.main will be created
  + resource "aws_acm_certificate_validation" "main" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_ecr_repository.frontend_service will be created
  + resource "aws_ecr_repository" "frontend_service" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "portfolio-frontend-service"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Owner"   = "Sihle Ndlovu"
          + "Project" = "Portfolio"
        }
      + tags_all             = {
          + "Owner"   = "Sihle Ndlovu"
          + "Project" = "Portfolio"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.game_service will be created
  + resource "aws_ecr_repository" "game_service" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "portfolio-game-service"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Owner"   = "Sihle Ndlovu"
          + "Project" = "Portfolio"
        }
      + tags_all             = {
          + "Owner"   = "Sihle Ndlovu"
          + "Project" = "Portfolio"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # cloudflare_record.acm_validation["*.cloudgt.co.za"] will be created
  + resource "cloudflare_record" "acm_validation" {
      + allow_overwrite = false
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = (known after apply)
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 60
      + type            = (known after apply)
      + value           = (known after apply)
      + zone_id         = "706bde896e93c6118ccea3f36ee729a1"
    }

  # cloudflare_record.acm_validation["cloudgt.co.za"] will be created
  + resource "cloudflare_record" "acm_validation" {
      + allow_overwrite = false
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = (known after apply)
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 60
      + type            = (known after apply)
      + value           = (known after apply)
      + zone_id         = "706bde896e93c6118ccea3f36ee729a1"
    }

  # cloudflare_record.monitoring will be created
  + resource "cloudflare_record" "monitoring" {
      + allow_overwrite = false
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "monitoring"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "706bde896e93c6118ccea3f36ee729a1"
    }

  # cloudflare_record.portfolio_app will be created
  + resource "cloudflare_record" "portfolio_app" {
      + allow_overwrite = false
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "sihle"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "706bde896e93c6118ccea3f36ee729a1"
    }

  # null_resource.build_and_push_images will be created
  + resource "null_resource" "build_and_push_images" {
      + id       = (known after apply)
      + triggers = {
          + "always_run" = (known after apply)
        }
    }

  # module.ecs.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.ecs.aws_cloudwatch_log_group.grafana[0] will be created
  + resource "aws_cloudwatch_log_group" "grafana" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/ecs/dev-portfolio-grafana"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-grafana-logs"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-grafana-logs"
        }
    }

  # module.ecs.aws_cloudwatch_log_group.prometheus[0] will be created
  + resource "aws_cloudwatch_log_group" "prometheus" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/ecs/dev-portfolio-prometheus"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-prometheus-logs"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-prometheus-logs"
        }
    }

  # module.ecs.aws_cloudwatch_log_group.services["frontend-service"] will be created
  + resource "aws_cloudwatch_log_group" "services" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/ecs/dev-portfolio-frontend-service"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-frontend-service-logs"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-frontend-service-logs"
        }
    }

  # module.ecs.aws_cloudwatch_log_group.services["game-service"] will be created
  + resource "aws_cloudwatch_log_group" "services" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/ecs/dev-portfolio-game-service"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-game-service-logs"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-game-service-logs"
        }
    }

  # module.ecs.aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "dev-portfolio-cluster"
      + tags     = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-cluster"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-cluster"
        }

      + setting {
          + name  = "containerInsights"
          + value = "disabled"
        }
    }

  # module.ecs.aws_ecs_service.monitoring[0] will be created
  + resource "aws_ecs_service" "monitoring" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "dev-portfolio-monitoring"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-monitoring"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-monitoring"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "grafana"
          + container_port   = 3000
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs.aws_ecs_service.services["frontend-service"] will be created
  + resource "aws_ecs_service" "services" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "dev-portfolio-frontend-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-frontend-service"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-frontend-service"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "frontend-service"
          + container_port   = 8080
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs.aws_ecs_service.services["game-service"] will be created
  + resource "aws_ecs_service" "services" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "dev-portfolio-game-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-game-service"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-game-service"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }

      + service_registries {
          + registry_arn = (known after apply)
        }
    }

  # module.ecs.aws_ecs_task_definition.monitoring[0] will be created
  + resource "aws_ecs_task_definition" "monitoring" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = (known after apply)
      + family                   = "dev-portfolio-monitoring"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-monitoring-task"
        }
      + tags_all                 = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-monitoring-task"
        }
      + task_role_arn            = (known after apply)
    }

  # module.ecs.aws_ecs_task_definition.services["frontend-service"] will be created
  + resource "aws_ecs_task_definition" "services" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "dev-portfolio-frontend-service"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-frontend-service-task"
        }
      + tags_all                 = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-frontend-service-task"
        }
      + task_role_arn            = (known after apply)
    }

  # module.ecs.aws_ecs_task_definition.services["game-service"] will be created
  + resource "aws_ecs_task_definition" "services" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "dev-portfolio-game-service"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-game-service-task"
        }
      + tags_all                 = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-game-service-task"
        }
      + task_role_arn            = (known after apply)
    }

  # module.ecs.aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-portfolio-ecs-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-ecs-task-execution-role"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-ecs-task-execution-role"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs.aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-portfolio-ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-ecs-task-role"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-ecs-task-role"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "dev-portfolio-ecs-task-execution-role"
    }

  # module.ecs.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = true
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "dev-portfolio-alb"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = (known after apply)
      + tags                                        = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-alb"
        }
      + tags_all                                    = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-alb"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.ecs.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.ecs.aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS-1-2-2017-01"
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Not Found"
              + status_code  = "404"
            }
        }
    }

  # module.ecs.aws_lb_listener_rule.grafana[0] will be created
  + resource "aws_lb_listener_rule" "grafana" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "monitoring.cloudgt.co.za",
                ]
            }
        }
    }

  # module.ecs.aws_lb_listener_rule.services["frontend-service"] will be created
  + resource "aws_lb_listener_rule" "services" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 50
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/*",
                ]
            }
        }
    }

  # module.ecs.aws_lb_target_group.grafana[0] will be created
  + resource "aws_lb_target_group" "grafana" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "dev-grafana-tg"
      + port                               = 3000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-grafana-tg"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-grafana-tg"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/api/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)
    }

  # module.ecs.aws_lb_target_group.services["frontend-service"] will be created
  + resource "aws_lb_target_group" "services" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "dev-frontend-service-tg"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-frontend-service-tg"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-frontend-service-tg"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)
    }

  # module.ecs.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "dev-portfolio-alb-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-alb-sg"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-alb-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ecs.aws_security_group.ecs_tasks will be created
  + resource "aws_security_group" "ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Grafana from ALB"
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3000
            },
          + {
              + cidr_blocks      = []
              + description      = "HTTP from ALB for frontend-service"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = []
              + description      = "Service to service"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 65535
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "dev-portfolio-ecs-tasks-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-ecs-tasks-sg"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-ecs-tasks-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ecs.aws_service_discovery_private_dns_namespace.main will be created
  + resource "aws_service_discovery_private_dns_namespace" "main" {
      + arn         = (known after apply)
      + description = "Service discovery namespace for portfolio services"
      + hosted_zone = (known after apply)
      + id          = (known after apply)
      + name        = "dev-portfolio.local"
      + tags        = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-namespace"
        }
      + tags_all    = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-namespace"
        }
      + vpc         = (known after apply)
    }

  # module.ecs.aws_service_discovery_service.services["game-service"] will be created
  + resource "aws_service_discovery_service" "services" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "game-service"
      + namespace_id  = (known after apply)
      + tags          = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-game-service-discovery"
        }
      + tags_all      = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-game-service-discovery"
        }
      + type          = (known after apply)

      + dns_config {
          + namespace_id   = (known after apply)
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 10
              + type = "A"
            }
        }
    }

  # module.network.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-nat-eip-1"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-nat-eip-1"
        }
      + vpc                  = (known after apply)
    }

  # module.network.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-nat-eip-2"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-nat-eip-2"
        }
      + vpc                  = (known after apply)
    }

  # module.network.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-igw"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-igw"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.aws_nat_gateway.main[0] will be created
  + resource "aws_nat_gateway" "main" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-nat-1"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-nat-1"
        }
    }

  # module.network.aws_nat_gateway.main[1] will be created
  + resource "aws_nat_gateway" "main" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-nat-2"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-nat-2"
        }
    }

  # module.network.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-private-rt-1"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-private-rt-1"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-private-rt-2"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-private-rt-2"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-public-rt"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-public-rt"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-private-1"
          + "Type"        = "Private"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-private-1"
          + "Type"        = "Private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-private-2"
          + "Type"        = "Private"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-private-2"
          + "Type"        = "Private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-public-1"
          + "Type"        = "Public"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-public-1"
          + "Type"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-public-2"
          + "Type"        = "Public"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-public-2"
          + "Type"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-vpc"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "dev-portfolio-vpc"
        }
    }

Plan: 51 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_dns_name     = (known after apply)
  + ecs_cluster_name = "dev-portfolio-cluster"
  + vpc_id           = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 2.
::debug::stdout: data.cloudflare_zone.this: Reading...%0Adata.aws_caller_identity.current: Reading...%0Amodule.network.data.aws_availability_zones.available: Reading...%0Adata.aws_caller_identity.current: Read complete after 0s [id=718307299417]%0Amodule.network.data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]%0Adata.cloudflare_zone.this: Read complete after 2s [id=706bde896e93c6118ccea3f36ee729a1]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # aws_acm_certificate.main will be created%0A  + resource "aws_acm_certificate" "main" {%0A      + arn                       = (known after apply)%0A      + domain_name               = "cloudgt.co.za"%0A      + domain_validation_options = [%0A          + {%0A              + domain_name           = "*.cloudgt.co.za"%0A              + resource_record_name  = (known after apply)%0A              + resource_record_type  = (known after apply)%0A              + resource_record_value = (known after apply)%0A            },%0A          + {%0A              + domain_name           = "cloudgt.co.za"%0A              + resource_record_name  = (known after apply)%0A              + resource_record_type  = (known after apply)%0A              + resource_record_value = (known after apply)%0A            },%0A        ]%0A      + id                        = (known after apply)%0A      + key_algorithm             = (known after apply)%0A      + not_after                 = (known after apply)%0A      + not_before                = (known after apply)%0A      + pending_renewal           = (known after apply)%0A      + renewal_eligibility       = (known after apply)%0A      + renewal_summary           = (known after apply)%0A      + status                    = (known after apply)%0A      + subject_alternative_names = [%0A          + "*.cloudgt.co.za",%0A          + "cloudgt.co.za",%0A        ]%0A      + tags                      = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-cert"%0A        }%0A      + tags_all                  = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-cert"%0A        }%0A      + type                      = (known after apply)%0A      + validation_emails         = (known after apply)%0A      + validation_method         = "DNS"%0A%0A      + options (known after apply)%0A    }%0A%0A  # aws_acm_certificate_validation.main will be created%0A  + resource "aws_acm_certificate_validation" "main" {%0A      + certificate_arn         = (known after apply)%0A      + id                      = (known after apply)%0A      + validation_record_fqdns = (known after apply)%0A    }%0A%0A  # aws_ecr_repository.frontend_service will be created%0A  + resource "aws_ecr_repository" "frontend_service" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "portfolio-frontend-service"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags                 = {%0A          + "Owner"   = "Sihle Ndlovu"%0A          + "Project" = "Portfolio"%0A        }%0A      + tags_all             = {%0A          + "Owner"   = "Sihle Ndlovu"%0A          + "Project" = "Portfolio"%0A        }%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0A  # aws_ecr_repository.game_service will be created%0A  + resource "aws_ecr_repository" "game_service" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "portfolio-game-service"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags                 = {%0A          + "Owner"   = "Sihle Ndlovu"%0A          + "Project" = "Portfolio"%0A        }%0A      + tags_all             = {%0A          + "Owner"   = "Sihle Ndlovu"%0A          + "Project" = "Portfolio"%0A        }%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0A  # cloudflare_record.acm_validation["*.cloudgt.co.za"] will be created%0A  + resource "cloudflare_record" "acm_validation" {%0A      + allow_overwrite = false%0A      + content         = (known after apply)%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = (known after apply)%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 60%0A      + type            = (known after apply)%0A      + value           = (known after apply)%0A      + zone_id         = "706bde896e93c6118ccea3f36ee729a1"%0A    }%0A%0A  # cloudflare_record.acm_validation["cloudgt.co.za"] will be created%0A  + resource "cloudflare_record" "acm_validation" {%0A      + allow_overwrite = false%0A      + content         = (known after apply)%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = (known after apply)%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 60%0A      + type            = (known after apply)%0A      + value           = (known after apply)%0A      + zone_id         = "706bde896e93c6118ccea3f36ee729a1"%0A    }%0A%0A  # cloudflare_record.monitoring will be created%0A  + resource "cloudflare_record" "monitoring" {%0A      + allow_overwrite = false%0A      + content         = (known after apply)%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "monitoring"%0A      + proxiable       = (known after apply)%0A      + proxied         = true%0A      + ttl             = 1%0A      + type            = "CNAME"%0A      + value           = (known after apply)%0A      + zone_id         = "706bde896e93c6118ccea3f36ee729a1"%0A    }%0A%0A  # cloudflare_record.portfolio_app will be created%0A  + resource "cloudflare_record" "portfolio_app" {%0A      + allow_overwrite = false%0A      + content         = (known after apply)%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "sihle"%0A      + proxiable       = (known after apply)%0A      + proxied         = true%0A      + ttl             = 1%0A      + type            = "CNAME"%0A      + value           = (known after apply)%0A      + zone_id         = "706bde896e93c6118ccea3f36ee729a1"%0A    }%0A%0A  # null_resource.build_and_push_images will be created%0A  + resource "null_resource" "build_and_push_images" {%0A      + id       = (known after apply)%0A      + triggers = {%0A          + "always_run" = (known after apply)%0A        }%0A    }%0A%0A  # module.ecs.data.aws_region.current will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_region" "current" {%0A      + description = (known after apply)%0A      + endpoint    = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A    }%0A%0A  # module.ecs.aws_cloudwatch_log_group.grafana[0] will be created%0A  + resource "aws_cloudwatch_log_group" "grafana" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + name              = "/ecs/dev-portfolio-grafana"%0A      + name_prefix       = (known after apply)%0A      + retention_in_days = 7%0A      + skip_destroy      = false%0A      + tags              = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-grafana-logs"%0A        }%0A      + tags_all          = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-grafana-logs"%0A        }%0A    }%0A%0A  # module.ecs.aws_cloudwatch_log_group.prometheus[0] will be created%0A  + resource "aws_cloudwatch_log_group" "prometheus" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + name              = "/ecs/dev-portfolio-prometheus"%0A      + name_prefix       = (known after apply)%0A      + retention_in_days = 7%0A      + skip_destroy      = false%0A      + tags              = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-prometheus-logs"%0A        }%0A      + tags_all          = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-prometheus-logs"%0A        }%0A    }%0A%0A  # module.ecs.aws_cloudwatch_log_group.services["frontend-service"] will be created%0A  + resource "aws_cloudwatch_log_group" "services" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + name              = "/ecs/dev-portfolio-frontend-service"%0A      + name_prefix       = (known after apply)%0A      + retention_in_days = 7%0A      + skip_destroy      = false%0A      + tags              = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-frontend-service-logs"%0A        }%0A      + tags_all          = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-frontend-service-logs"%0A        }%0A    }%0A%0A  # module.ecs.aws_cloudwatch_log_group.services["game-service"] will be created%0A  + resource "aws_cloudwatch_log_group" "services" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + name              = "/ecs/dev-portfolio-game-service"%0A      + name_prefix       = (known after apply)%0A      + retention_in_days = 7%0A      + skip_destroy      = false%0A      + tags              = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-game-service-logs"%0A        }%0A      + tags_all          = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-game-service-logs"%0A        }%0A    }%0A%0A  # module.ecs.aws_ecs_cluster.main will be created%0A  + resource "aws_ecs_cluster" "main" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + name     = "dev-portfolio-cluster"%0A      + tags     = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-cluster"%0A        }%0A      + tags_all = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-cluster"%0A        }%0A%0A      + setting {%0A          + name  = "containerInsights"%0A          + value = "disabled"%0A        }%0A    }%0A%0A  # module.ecs.aws_ecs_service.monitoring[0] will be created%0A  + resource "aws_ecs_service" "monitoring" {%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 1%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "dev-portfolio-monitoring"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags                               = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-monitoring"%0A        }%0A      + tags_all                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-monitoring"%0A        }%0A      + task_definition                    = (known after apply)%0A      + triggers                           = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + load_balancer {%0A          + container_name   = "grafana"%0A          + container_port   = 3000%0A          + target_group_arn = (known after apply)%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = (known after apply)%0A          + subnets          = (known after apply)%0A        }%0A    }%0A%0A  # module.ecs.aws_ecs_service.services["frontend-service"] will be created%0A  + resource "aws_ecs_service" "services" {%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 1%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "dev-portfolio-frontend-service"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags                               = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-frontend-service"%0A        }%0A      + tags_all                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-frontend-service"%0A        }%0A      + task_definition                    = (known after apply)%0A      + triggers                           = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + load_balancer {%0A          + container_name   = "frontend-service"%0A          + container_port   = 8080%0A          + target_group_arn = (known after apply)%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = (known after apply)%0A          + subnets          = (known after apply)%0A        }%0A    }%0A%0A  # module.ecs.aws_ecs_service.services["game-service"] will be created%0A  + resource "aws_ecs_service" "services" {%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 1%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "dev-portfolio-game-service"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags                               = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-game-service"%0A        }%0A      + tags_all                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-game-service"%0A        }%0A      + task_definition                    = (known after apply)%0A      + triggers                           = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = (known after apply)%0A          + subnets          = (known after apply)%0A        }%0A%0A      + service_registries {%0A          + registry_arn = (known after apply)%0A        }%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.monitoring[0] will be created%0A  + resource "aws_ecs_task_definition" "monitoring" {%0A      + arn                      = (known after apply)%0A      + arn_without_revision     = (known after apply)%0A      + container_definitions    = (known after apply)%0A      + cpu                      = "512"%0A      + execution_role_arn       = (known after apply)%0A      + family                   = "dev-portfolio-monitoring"%0A      + id                       = (known after apply)%0A      + memory                   = "1024"%0A      + network_mode             = "awsvpc"%0A      + requires_compatibilities = [%0A          + "FARGATE",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags                     = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-monitoring-task"%0A        }%0A      + tags_all                 = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-monitoring-task"%0A        }%0A      + task_role_arn            = (known after apply)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.services["frontend-service"] will be created%0A  + resource "aws_ecs_task_definition" "services" {%0A      + arn                      = (known after apply)%0A      + arn_without_revision     = (known after apply)%0A      + container_definitions    = (known after apply)%0A      + cpu                      = "256"%0A      + execution_role_arn       = (known after apply)%0A      + family                   = "dev-portfolio-frontend-service"%0A      + id                       = (known after apply)%0A      + memory                   = "512"%0A      + network_mode             = "awsvpc"%0A      + requires_compatibilities = [%0A          + "FARGATE",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags                     = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-frontend-service-task"%0A        }%0A      + tags_all                 = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-frontend-service-task"%0A        }%0A      + task_role_arn            = (known after apply)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.services["game-service"] will be created%0A  + resource "aws_ecs_task_definition" "services" {%0A      + arn                      = (known after apply)%0A      + arn_without_revision     = (known after apply)%0A      + container_definitions    = (known after apply)%0A      + cpu                      = "256"%0A      + execution_role_arn       = (known after apply)%0A      + family                   = "dev-portfolio-game-service"%0A      + id                       = (known after apply)%0A      + memory                   = "512"%0A      + network_mode             = "awsvpc"%0A      + requires_compatibilities = [%0A          + "FARGATE",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags                     = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-game-service-task"%0A        }%0A      + tags_all                 = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-game-service-task"%0A        }%0A      + task_role_arn            = (known after apply)%0A    }%0A%0A  # module.ecs.aws_iam_role.ecs_task_execution_role will be created%0A  + resource "aws_iam_role" "ecs_task_execution_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "dev-portfolio-ecs-task-execution-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + role_last_used        = (known after apply)%0A      + tags                  = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-ecs-task-execution-role"%0A        }%0A      + tags_all              = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-ecs-task-execution-role"%0A        }%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # module.ecs.aws_iam_role.ecs_task_role will be created%0A  + resource "aws_iam_role" "ecs_task_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "dev-portfolio-ecs-task-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + role_last_used        = (known after apply)%0A      + tags                  = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-ecs-task-role"%0A        }%0A      + tags_all              = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-ecs-task-role"%0A        }%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be created%0A  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"%0A      + role       = "dev-portfolio-ecs-task-execution-role"%0A    }%0A%0A  # module.ecs.aws_lb.main will be created%0A  + resource "aws_lb" "main" {%0A      + arn                                         = (known after apply)%0A      + arn_suffix                                  = (known after apply)%0A      + desync_mitigation_mode                      = "defensive"%0A      + dns_name                                    = (known after apply)%0A      + drop_invalid_header_fields                  = true%0A      + enable_deletion_protection                  = false%0A      + enable_http2                                = true%0A      + enable_tls_version_and_cipher_suite_headers = false%0A      + enable_waf_fail_open                        = false%0A      + enable_xff_client_port                      = false%0A      + id                                          = (known after apply)%0A      + idle_timeout                                = 60%0A      + internal                                    = false%0A      + ip_address_type                             = (known after apply)%0A      + load_balancer_type                          = "application"%0A      + name                                        = "dev-portfolio-alb"%0A      + preserve_host_header                        = false%0A      + security_groups                             = (known after apply)%0A      + subnets                                     = (known after apply)%0A      + tags                                        = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-alb"%0A        }%0A      + tags_all                                    = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-alb"%0A        }%0A      + vpc_id                                      = (known after apply)%0A      + xff_header_processing_mode                  = "append"%0A      + zone_id                                     = (known after apply)%0A%0A      + subnet_mapping (known after apply)%0A    }%0A%0A  # module.ecs.aws_lb_listener.http will be created%0A  + resource "aws_lb_listener" "http" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + load_balancer_arn = (known after apply)%0A      + port              = 80%0A      + protocol          = "HTTP"%0A      + ssl_policy        = (known after apply)%0A      + tags_all          = (known after apply)%0A%0A      + default_action {%0A          + order = (known after apply)%0A          + type  = "redirect"%0A%0A          + redirect {%0A              + host        = "#{host}"%0A              + path        = "/#{path}"%0A              + port        = "443"%0A              + protocol    = "HTTPS"%0A              + query       = "#{query}"%0A              + status_code = "HTTP_301"%0A            }%0A        }%0A    }%0A%0A  # module.ecs.aws_lb_listener.https will be created%0A  + resource "aws_lb_listener" "https" {%0A      + arn               = (known after apply)%0A      + certificate_arn   = (known after apply)%0A      + id                = (known after apply)%0A      + load_balancer_arn = (known after apply)%0A      + port              = 443%0A      + protocol          = "HTTPS"%0A      + ssl_policy        = "ELBSecurityPolicy-TLS-1-2-2017-01"%0A      + tags_all          = (known after apply)%0A%0A      + default_action {%0A          + order = (known after apply)%0A          + type  = "fixed-response"%0A%0A          + fixed_response {%0A              + content_type = "text/plain"%0A              + message_body = "Not Found"%0A              + status_code  = "404"%0A            }%0A        }%0A    }%0A%0A  # module.ecs.aws_lb_listener_rule.grafana[0] will be created%0A  + resource "aws_lb_listener_rule" "grafana" {%0A      + arn          = (known after apply)%0A      + id           = (known after apply)%0A      + listener_arn = (known after apply)%0A      + priority     = 100%0A      + tags_all     = (known after apply)%0A%0A      + action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A%0A      + condition {%0A          + host_header {%0A              + values = [%0A                  + "monitoring.cloudgt.co.za",%0A                ]%0A            }%0A        }%0A    }%0A%0A  # module.ecs.aws_lb_listener_rule.services["frontend-service"] will be created%0A  + resource "aws_lb_listener_rule" "services" {%0A      + arn          = (known after apply)%0A      + id           = (known after apply)%0A      + listener_arn = (known after apply)%0A      + priority     = 50%0A      + tags_all     = (known after apply)%0A%0A      + action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A%0A      + condition {%0A          + path_pattern {%0A              + values = [%0A                  + "/*",%0A                ]%0A            }%0A        }%0A    }%0A%0A  # module.ecs.aws_lb_target_group.grafana[0] will be created%0A  + resource "aws_lb_target_group" "grafana" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = false%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "dev-grafana-tg"%0A      + port                               = 3000%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-grafana-tg"%0A        }%0A      + tags_all                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-grafana-tg"%0A        }%0A      + target_type                        = "ip"%0A      + vpc_id                             = (known after apply)%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 2%0A          + interval            = 30%0A          + matcher             = "200"%0A          + path                = "/api/health"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 5%0A          + unhealthy_threshold = 2%0A        }%0A%0A      + stickiness (known after apply)%0A%0A      + target_failover (known after apply)%0A    }%0A%0A  # module.ecs.aws_lb_target_group.services["frontend-service"] will be created%0A  + resource "aws_lb_target_group" "services" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = false%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "dev-frontend-service-tg"%0A      + port                               = 8080%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-frontend-service-tg"%0A        }%0A      + tags_all                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-frontend-service-tg"%0A        }%0A      + target_type                        = "ip"%0A      + vpc_id                             = (known after apply)%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 2%0A          + interval            = 30%0A          + matcher             = "200"%0A          + path                = "/health"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 5%0A          + unhealthy_threshold = 2%0A        }%0A%0A      + stickiness (known after apply)%0A%0A      + target_failover (known after apply)%0A    }%0A%0A  # module.ecs.aws_security_group.alb will be created%0A  + resource "aws_security_group" "alb" {%0A      + arn                    = (known after apply)%0A      + description            = "Managed by Terraform"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A                # (1 unchanged attribute hidden)%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "HTTP"%0A              + from_port        = 80%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 80%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "HTTPS"%0A              + from_port        = 443%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 443%0A            },%0A        ]%0A      + name                   = (known after apply)%0A      + name_prefix            = "dev-portfolio-alb-"%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-alb-sg"%0A        }%0A      + tags_all               = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-alb-sg"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # module.ecs.aws_security_group.ecs_tasks will be created%0A  + resource "aws_security_group" "ecs_tasks" {%0A      + arn                    = (known after apply)%0A      + description            = "Managed by Terraform"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A                # (1 unchanged attribute hidden)%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = []%0A              + description      = "Grafana from ALB"%0A              + from_port        = 3000%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = (known after apply)%0A              + self             = false%0A              + to_port          = 3000%0A            },%0A          + {%0A              + cidr_blocks      = []%0A              + description      = "HTTP from ALB for frontend-service"%0A              + from_port        = 8080%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = (known after apply)%0A              + self             = false%0A              + to_port          = 8080%0A            },%0A          + {%0A              + cidr_blocks      = []%0A              + description      = "Service to service"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = true%0A              + to_port          = 65535%0A            },%0A        ]%0A      + name                   = (known after apply)%0A      + name_prefix            = "dev-portfolio-ecs-tasks-"%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-ecs-tasks-sg"%0A        }%0A      + tags_all               = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-ecs-tasks-sg"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # module.ecs.aws_service_discovery_private_dns_namespace.main will be created%0A  + resource "aws_service_discovery_private_dns_namespace" "main" {%0A      + arn         = (known after apply)%0A      + description = "Service discovery namespace for portfolio services"%0A      + hosted_zone = (known after apply)%0A      + id          = (known after apply)%0A      + name        = "dev-portfolio.local"%0A      + tags        = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-namespace"%0A        }%0A      + tags_all    = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-namespace"%0A        }%0A      + vpc         = (known after apply)%0A    }%0A%0A  # module.ecs.aws_service_discovery_service.services["game-service"] will be created%0A  + resource "aws_service_discovery_service" "services" {%0A      + arn           = (known after apply)%0A      + force_destroy = false%0A      + id            = (known after apply)%0A      + name          = "game-service"%0A      + namespace_id  = (known after apply)%0A      + tags          = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-game-service-discovery"%0A        }%0A      + tags_all      = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-game-service-discovery"%0A        }%0A      + type          = (known after apply)%0A%0A      + dns_config {%0A          + namespace_id   = (known after apply)%0A          + routing_policy = "MULTIVALUE"%0A%0A          + dns_records {%0A              + ttl  = 10%0A              + type = "A"%0A            }%0A        }%0A    }%0A%0A  # module.network.aws_eip.nat[0] will be created%0A  + resource "aws_eip" "nat" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = "vpc"%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags                 = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-nat-eip-1"%0A        }%0A      + tags_all             = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-nat-eip-1"%0A        }%0A      + vpc                  = (known after apply)%0A    }%0A%0A  # module.network.aws_eip.nat[1] will be created%0A  + resource "aws_eip" "nat" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = "vpc"%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags                 = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-nat-eip-2"%0A        }%0A      + tags_all             = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-nat-eip-2"%0A        }%0A      + vpc                  = (known after apply)%0A    }%0A%0A  # module.network.aws_internet_gateway.main will be created%0A  + resource "aws_internet_gateway" "main" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags     = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-igw"%0A        }%0A      + tags_all = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-igw"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # module.network.aws_nat_gateway.main[0] will be created%0A  + resource "aws_nat_gateway" "main" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + connectivity_type    = "public"%0A      + id                   = (known after apply)%0A      + network_interface_id = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + subnet_id            = (known after apply)%0A      + tags                 = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-nat-1"%0A        }%0A      + tags_all             = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-nat-1"%0A        }%0A    }%0A%0A  # module.network.aws_nat_gateway.main[1] will be created%0A  + resource "aws_nat_gateway" "main" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + connectivity_type    = "public"%0A      + id                   = (known after apply)%0A      + network_interface_id = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + subnet_id            = (known after apply)%0A      + tags                 = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-nat-2"%0A        }%0A      + tags_all             = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-nat-2"%0A        }%0A    }%0A%0A  # module.network.aws_route_table.private[0] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + cidr_block                 = "0.0.0.0/0"%0A              + nat_gateway_id             = (known after apply)%0A                # (11 unchanged attributes hidden)%0A            },%0A        ]%0A      + tags             = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-private-rt-1"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-private-rt-1"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table.private[1] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + cidr_block                 = "0.0.0.0/0"%0A              + nat_gateway_id             = (known after apply)%0A                # (11 unchanged attributes hidden)%0A            },%0A        ]%0A      + tags             = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-private-rt-2"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-private-rt-2"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table.public will be created%0A  + resource "aws_route_table" "public" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + cidr_block                 = "0.0.0.0/0"%0A              + gateway_id                 = (known after apply)%0A                # (11 unchanged attributes hidden)%0A            },%0A        ]%0A      + tags             = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-public-rt"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-public-rt"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table_association.private[0] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table_association.private[1] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table_association.public[0] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table_association.public[1] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.aws_subnet.private[0] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "eu-west-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.10.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-private-1"%0A          + "Type"        = "Private"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-private-1"%0A          + "Type"        = "Private"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.aws_subnet.private[1] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "eu-west-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.11.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-private-2"%0A          + "Type"        = "Private"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-private-2"%0A          + "Type"        = "Private"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.aws_subnet.public[0] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "eu-west-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.0.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-public-1"%0A          + "Type"        = "Public"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-public-1"%0A          + "Type"        = "Public"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.aws_subnet.public[1] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "eu-west-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-public-2"%0A          + "Type"        = "Public"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-public-2"%0A          + "Type"        = "Public"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.aws_vpc.main will be created%0A  + resource "aws_vpc" "main" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.0.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags                                 = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-vpc"%0A        }%0A      + tags_all                             = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-portfolio-vpc"%0A        }%0A    }%0A%0APlan: 51 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + alb_dns_name     = (known after apply)%0A  + ecs_cluster_name = "dev-portfolio-cluster"%0A  + vpc_id           = (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 2
```
</details>

### 🚀 Next Steps
- ℹ️ No infrastructure changes detected
- Monitor deployment in GitHub Actions after merge

---
*🐘 Generated by Elephant TF CI Bot*